## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be updated in-place
  ~ resource "azurerm_linux_function_app" "observe_collect_function_app" {
        id                                             = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-flex-plan-pvt-endpoint/providers/Microsoft.Web/sites/gh-fa-nikhil-flex-plan-pvt-endpoint"
        name                                           = "gh-fa-nikhil-flex-plan-pvt-endpoint"
      ~ tags                                           = {
            "branch"                                         = "nikhil-flex-plan-pvt-endpoint"
            "created_by"                                     = "terraform-ci"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=97530fa7-8c7e-4abe-9eac-83f4d59a7bfb;IngestionEndpoint=https://centralus-2.in.applicationinsights.azure.com/;LiveEndpoint=https://centralus.livediagnostics.monitor.azure.com/;ApplicationId=cf0667e5-c7be-4757-8262-8db28b2ab4dc" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "97530fa7-8c7e-4abe-9eac-83f4d59a7bfb" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-flex-plan-pvt-endpoint/providers/microsoft.insights/components/gh-fa-nikhil-flex-plan-pvt-endpoint" -> null
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
          - application_insights_key                      = (sensitive value) -> null
            # (31 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - sticky_settings {
          - app_setting_names       = [
              - "APPINSIGHTS_INSTRUMENTATIONKEY",
              - "APPLICATIONINSIGHTS_CONNECTION_STRING ",
              - "APPINSIGHTS_PROFILERFEATURE_VERSION",
              - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              - "ApplicationInsightsAgent_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_BaseExtensions",
              - "DiagnosticServices_EXTENSION_VERSION",
              - "InstrumentationEngine_EXTENSION_VERSION",
              - "SnapshotDebugger_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_Mode",
              - "XDT_MicrosoftApplicationInsights_PreemptSdk",
              - "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              - "XDT_MicrosoftApplicationInsightsJava",
              - "XDT_MicrosoftApplicationInsights_NodeJS",
            ] -> null
          - connection_string_names = [] -> null
        }

        # (1 unchanged block hidden)
    }

  # module.terraform-azure-collection.azurerm_storage_account.observe_storage_account_secured will be created
  + resource "azurerm_storage_account" "observe_storage_account_secured" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "centralus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "179969258044cu6c351029"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "gh-rg-nikhil-flex-plan-pvt-endpoint"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.terraform-azure-collection.azurerm_storage_share.observe_storage_account_secured_share will be created
  + resource "azurerm_storage_share" "observe_storage_account_secured_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "gh-fa-nikhil-flex-plan-pvt-endpoint-aea2"
      + quota                = 102400
      + resource_manager_id  = (known after apply)
      + storage_account_name = "179969258044cu6c351029"
      + url                  = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>